org-html/English-2010.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-18 日 23:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>English 2010</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="hiro" />
<link rel="stylesheet" type="text/css" href="/home/hiro/Documents/org-files/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">English 2010</h1>
<ul class="org-ul">
<li>the most far-reaching 影响最深远的</li>
<li>inexorable 不可阻挡的</li>
<li>coverage 覆盖；新闻</li>
<li>marvel 感到神奇的</li>
<li>marble 大理石</li>
<li>circulation 传播</li>
<li>daily 日报</li>
<li>ornament 装饰品</li>
<li>calling 职业；欲望</li>
<li>keep/hold their own end up 在困难面前坚持下去</li>
<li>a term of contempt 轻视</li>
<li>cricket 板球</li>
<li>foremost 最好的</li>
<li>stylist 设计师</li>
<li>autobiography 自传</li>
<li>knight 骑士</li>
<li>amateur 业余的</li>
<li>vast 巨大的；广阔的</li>
<li>revival 复兴；恢复</li>
<li>postmodern 后现代的</li>
<li>retreat 后退</li>
<li>casual 非正式的</li>
<li>elaborate 精心制作的</li>
<li>horizon 地平线；视野</li>
<li>allocation 分配</li>
<li>scale back 减少数量</li>
<li>authorize 授权</li>
<li>eliminate 撤消，消除</li>
<li>claim 提出要求；申请</li>
<li>curb 控制；勒马</li>
<li>explosion 爆发</li>
<li>defensive move against 针对……的防御措施</li>
<li>hedging 限制</li>
<li>practice 实践</li>
<li>hear a case 审理案件</li>
<li>in the wake of 随着某事到来</li>
<li>uphold 支持</li>
<li>attorney 律师</li>
<li>tiny minority 极少数</li>
<li>epidemic 流行的（传染病）</li>
<li>influential 有影响力的人</li>
<li>embrace 拥抱</li>
<li>plausible 接口解释的；貌似有理的</li>
<li>cursory 粗略的</li>
<li>presence 出席</li>
<li>cascade 瀑布</li>
<li>in turn 反过来</li>
<li>propagate 传播；传送</li>
<li>simulation 模拟</li>
<li>manipulate 暗中操作</li>
<li>readiness 准备就绪的；愿意的</li>
<li>overall plan 总体计划</li>
<li>on the wrong planet 不合实际</li>
<li>skeptical 害怕的</li>
<li>bad debts 坏账</li>
<li>paralysis 瘫痪的</li>
<li>bargain 交易；便宜货</li>
<li>combative 好战的</li>
<li>buy up 全部买进</li>
<li>give in to 屈服；让步</li>
<li>make more concession 做出让步</li>
<li>hostility 敌意</li>
<li>clean up 清理</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="author">Author: hiro</p>
<p class="date">Created: 2018-11-18 日 23:30</p>
<p class="validation"></p>
</div>
</body>
</html>
